{
  "Масштабируемость":"Способность информационной системы адаптироваться к резкому изменению показателей задач и повышению требований (например, увеличение объемов данных, числа пользователей, и т.д.)",
  "Балансировка нагрузки":"Метод распределения сетевого трафика и задач между сетевыми устройствами",
  "Кластеризация":"Задача разбиения множества объектов на группы, называемые кластерами. Внутри каждой группы должны оказаться «похожие» объекты, а объекты разных группы должны быть как можно более отличны",
  "Модульность":"Свойство системы, связанное с возможностью её декомпозиции на ряд внутренне связанных между собой модулей",
  "Распределенные системы":"Набор независимых компьютеров, не имеющих общей совместно используемой памяти и общего единого времени (таймера) и взаимодействующих через коммуникационную сеть посредством передачи сообщений, где каждый компьютер использует свою собственную оперативную память и на котором выполняется отдельный экземпляр своей операционной системы",
  "Кроссплатформенность":"Способность программного обеспечения работать с несколькими аппаратными платформами или операционными системами. Обеспечивается благодаря использованию высокоуровневых языков программирования, сред разработки и выполнения, поддерживающих условную компиляцию, компоновку и выполнение кода для различных платформ",
  "Жизненный цикл ПО":"Жизненный цикл программного обеспечения, период времени, который начинается с момента принятия решения о необходимости создания программного продукта и заканчивается в момент его полного изъятия из эксплуатации",
  "Сервер":"Выделенный или специализированный компьютер для выполнения сервисного программного обеспечения",
  "Клиент":"Аппаратный или программный компонент вычислительной системы, посылающий запросы серверу",
  "Кластер":"Группа компьютеров, объединённых высокоскоростными каналами связи и представляющая с точки зрения пользователя единый аппаратный ресурс; также – группа серверов, объединённых логически, способных обрабатывать идентичные запросы и использующихся как единый ресурс",
  "Архитектура системы":"Концептуальная модель, которая определяет структуру, поведение и другие представления системы. Системная архитектура может состоять из системных компонентов и разработанных подсистем, которые будут работать вместе для реализации общей системы",
  "СУБД":"Служит интерфейсом между базой данных и пользователями или программами, предоставляя пользователям возможность получать и обновлять информацию, а также управлять ее упорядочением и оптимизацией. СУБД обеспечивает контроль и управление данными, позволяя выполнять различные административные операции, такие как мониторинг производительности, настройка, а также резервное копирование и восстановление",
  "Надежность ПО":"Надежность программного обеспечения, это способность программного продукта выполнять определенные функции в определенных условиях и в течение определенного интервала времени. Указанные условия относятся к состоянию компьютерной системы с использованием программного обеспечения и входным условиям программного обеспечения, которые непосредственно связаны с работой программного обеспечения",
  "Кэширование":"Процесс сохранения данных локально, который позволяет быстрее получить к ним доступ при будущих запросах. В самом распространенном типе кэширования, кэшировании веб-браузера, веб-браузер хранит копии статических данных на локальном жестком диске. Используя кеширование, веб-браузер может избежать многократных циклов приема-передачи на сервер и вместо этого получать доступ к тем же данным локально, что экономит время и ресурсы",
  "Отладка":"Поиск (локализация), анализ и устранение ошибок в программном обеспечении, которые были найдены во время тестирования",
  "Совместимость":"Свойство объекта (процесса, системы) вступать во взаимодействие с другими объектами (процессами, системами), при котором участвующие в указанном взаимодействии объекты (процессы, системы) не в полной мере исключают проявление друг друга"
}
